In [1]:
import matplotlib.pyplot as plt

In [25]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\user\anaconda3\lib\site-packages (9.4.0)

In [2]:
import mysql.connector
import pandas as pd
import sqlalchemy
import warnings
warnings.filterwarnings('ignore')

In [3]:
db=mysql.connector.connect(
    host="localhost",
    user="root",
    password="mukesh123@",
    database="foodpanda"
)
mycursor=db.cursor()
print(db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000225438AFCB0>

In [4]:
query="SELECT * FROM orders"
order_data=pd.read_sql(query,db)

In [65]:
order_data.head()

,customer_id,gender,age,city,order_id,order_date,signup_date,restaurant_name,dish_name,category,quantity,price,payment_method,order_frequency,last_order_date,loyalty_points,churned,rating,rating_date,delivery_status
0,C6000,Other,Senior,Peshawar,O10000,2024-08-14,2023-11-14,KFC,Pasta,Dessert,4,760.35,Wallet,11,2025-01-16,2,Inactive,5,2025-04-07,Delivered
1,C6001,Other,Teenager,Peshawar,O10001,2024-11-07,2024-07-31,McDonald's,Pasta,Chinese,3,847.29,Cash,31,2024-11-20,171,Active,5,2025-05-13,Delivered
2,C6002,Other,Senior,Multan,O10002,2024-03-24,2025-07-16,KFC,Fries,Continental,4,1311.76,Wallet,14,2024-12-05,130,Active,5,2025-06-08,Delivered
3,C6003,Male,Teenager,Lahore,O10003,2025-04-06,2024-03-08,Burger King,Sandwich,Dessert,4,1046.47,Wallet,7,2024-09-08,401,Active,4,2025-04-29,Delivered
4,C6004,Male,Adult,Lahore,O10004,2024-03-19,2025-08-04,KFC,Burger,Chinese,3,702.15,Wallet,50,2024-10-08,167,Inactive,4,2024-12-08,Cancelled

In [66]:
order_data.shape

(6000, 20)

In [67]:
order_data.columns

Index(['customer_id', 'gender', 'age', 'city', 'order_id', 'order_date',
       'signup_date', 'restaurant_name', 'dish_name', 'category', 'quantity',
       'price', 'payment_method', 'order_frequency', 'last_order_date',
       'loyalty_points', 'churned', 'rating', 'rating_date',
       'delivery_status'],
      dtype='object')

In [68]:
order_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6000 entries, 0 to 5999
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      6000 non-null   object
 1   gender           6000 non-null   object
 2   age              6000 non-null   object
 3   city             6000 non-null   object
 4   order_id         6000 non-null   object
 5   order_date       6000 non-null   object
 6   signup_date      6000 non-null   object
 7   restaurant_name  6000 non-null   object
 8   dish_name        6000 non-null   object
 9   category         6000 non-null   object
 10  quantity         6000 non-null   int64
 11  price            6000 non-null   float64
 12  payment_method   6000 non-null   object
 13  order_frequency  6000 non-null   int64
 14  last_order_date  6000 non-null   object
 15  loyalty_points   6000 non-null   int64
 16  churned          6000 non-null   object
 17  rating           6000 non-null   int64
 18  rating_date      6000 non-null   object
 19  delivery_status  6000 non-null   object
dtypes: float64(1), int64(4), object(15)
memory usage: 937.6+ KB

In [69]:
order_data.describe()

          quantity        price  order_frequency  loyalty_points       rating
count  6000.000000  6000.000000      6000.000000     6000.000000  6000.000000
mean      2.991667   800.524880        25.304667      250.173667     2.996833
std       1.414778   404.855029        14.358930      144.608478     1.406113
min       1.000000   100.300000         1.000000        0.000000     1.000000
25%       2.000000   441.997500        13.000000      125.000000     2.000000
50%       3.000000   806.460000        25.000000      249.500000     3.000000
75%       4.000000  1149.737500        37.000000      378.000000     4.000000
max       5.000000  1499.950000        50.000000      500.000000     5.000000

In [70]:
# 📊 Customer Insights

In [71]:
# 1. Total customers by city
query="""
SELECT city, COUNT(DISTINCT customer_id) as Total_customers
FROM orders GROUP BY CITY
"""
df=pd.read_sql(query,db)
print(df)

        city  Total_customers
0  Islamabad             1187
1    Karachi             1145
2     Lahore             1217
3     Multan             1256
4   Peshawar             1195

In [44]:
# Q2: Give the gender distribution of customers? 
query="""
SELECT gender, COUNT(*) as Total
FROM orders GROUP BY gender
"""
df=pd.read_sql(query,db)
print(df)

   gender  Total
0   Other   1965
1    Male   2017
2  Female   2018

In [45]:
# Q3: What is the average number of lifetime orders per customer?
query="""
SELECT AVG(order_frequency) AS avg_orders_per_customer 
FROM orders;
"""
df=pd.read_sql(query,db)
print(df)

   avg_orders_per_customer
0                  25.3047

In [46]:
# Q4: Who are the top 5 most loyal customers based on loyalty points?  
query="""
SELECT customer_id, loyalty_points  
FROM orders ORDER BY loyalty_points DESC LIMIT 5 ;
"""
df=pd.read_sql(query,db)
print(df)

  customer_id  loyalty_points
0       C6315             500
1       C6952             500
2       C6363             500
3       C1120             500
4       C1480             500

In [6]:
# Q5: How many customers are active vs inactive?  
query="""
SELECT churned, count(*)
FROM orders GROUP BY churned;
"""
df=pd.read_sql(query,db)
print(df)

    churned  count(*)
0  Inactive      2984
1    Active      3016

In [ ]:
# 💰 Sales & Revenue

In [7]:
# Q6: What is the total revenue generated overall?  
query="""
SELECT SUM(price*quantity) as Total_revenue
FROM orders
"""
df=pd.read_sql(query,db)
print(df)

   Total_revenue
0    14343912.08

In [10]:
# Q7: How much revenue does each city generate?  
query="""
SELECT city, SUM(price*quantity) as City_revenue
FROM orders
GROUP BY city 
ORDER BY City_revenue DESC
"""
df=pd.read_sql(query,db)
print(df)

        city  City_revenue
0     Multan    3052313.80
1     Lahore    2916372.35
2   Peshawar    2906686.38
3  Islamabad    2835310.27
4    Karachi    2633229.28

In [12]:
 # Q8: Which are the top 5 restaurants by revenue?  
query="""
SELECT restaurant_name, SUM(price*quantity) as Top_resto_rev
FROM orders
GROUP BY restaurant_name
ORDER BY Top_resto_rev DESC LIMIT 5
"""
df=pd.read_sql(query,db)
print(df)

  restaurant_name  Top_resto_rev
0       Pizza Hut     3002380.59
1          Subway     2998014.27
2             KFC     2954233.45
3     Burger King     2752780.87
4      McDonald's     2636502.90

In [13]:
# Q9: Which dish is the most sold overall? 
query="""
SELECT dish_name, SUM(price*quantity) as Most_sold_dish
FROM orders
GROUP BY dish_name
ORDER BY Most_sold_dish DESC LIMIT 1
"""
df=pd.read_sql(query,db)
print(df)

  dish_name  Most_sold_dish
0     Pasta      3078850.36

In [16]:
# Q10: What is the monthly revenue trend?  
query="""
SELECT DATE_FORMAT(order_date, '%Y-%m') AS Month,
SUM(price*quantity) as Monthly_revenue
FROM orders
GROUP BY Month
ORDER BY Month
"""
df=pd.read_sql(query,db)
print(df)

      Month  Monthly_revenue
0   2023-08        173278.01
1   2023-09        696622.20
2   2023-10        665298.47
3   2023-11        531467.85
4   2023-12        671064.46
5   2024-01        672698.48
6   2024-02        502002.28
7   2024-03        558305.99
8   2024-04        634813.26
9   2024-05        556435.44
10  2024-06        616952.97
11  2024-07        617071.18
12  2024-08        562486.28
13  2024-09        600866.88
14  2024-10        590091.22
15  2024-11        625472.42
16  2024-12        591899.77
17  2025-01        643669.36
18  2025-02        594787.21
19  2025-03        683896.55
20  2025-04        515852.35
21  2025-05        525369.44
22  2025-06        548905.71
23  2025-07        522188.18
24  2025-08        442416.12

In [ ]:
# 🚚 Operations

In [17]:
# Q11: How many orders fall into each delivery status category?  
query="""
SELEct delivery_status, COUNT(*) 
FROM orders 
GROUP BY delivery_status;
"""
df=pd.read_sql(query,db)
print(df)

  delivery_status  COUNT(*)
0       Delivered      2060
1       Cancelled      1968
2         Delayed      1972

In [22]:
# Q12: What is the average order size (items per order)?  
query="""
SELECT avg(quantity) as Average_quantity
FROM orders 
"""
df=pd.read_sql(query,db)
print(df)

   Average_quantity
0            2.9917

In [24]:
# Q13: What is the average delivery rating?  
query="""
SELECT avg(rating) as Average_rating
FROM orders 
"""
df=pd.read_sql(query,db)
print(df)

   Average_rating
0          2.9968

In [32]:
# Q14: Which cities have the highest delivery delay rates? 
query="""
SELECT city, SUM(delivery_status='Delayed') / COUNT(*) * 100 AS delay_rate_percentage
FROM orders 
GROUP BY city
ORDER BY delay_rate_percentage DESC; 
"""
df=pd.read_sql(query,db)
print(df)

        city  delay_rate_percentage
0   Peshawar                33.3891
1  Islamabad                32.9402
2    Karachi                32.8384
3     Multan                32.6433
4     Lahore                32.5390

In [35]:
# Q15: What is the peak order day of the week?  
query="""
SELECT DAYNAME(order_date) as Day, COUNT(*) as Total_order
FROM orders 
GROUP BY Day
ORDER BY Total_order DESC; 
"""
df=pd.read_sql(query,db)
print(df)

         Day  Total_order
0     Monday          892
1     Friday          878
2     Sunday          877
3   Thursday          864
4   Saturday          864
5    Tuesday          813
6  Wednesday          812

In [ ]:
# 🎯 Marketing

In [38]:
# Q16: How many customers were acquired each month? 
query="""
SELECT DATE_FORMAT(signup_date, '%Y-%m') AS month, COUNT(DISTINCT customer_id)as Acquired_cus_each_month
FROM orders 
GROUP BY month 
ORDER BY month;
"""
df=pd.read_sql(query,db)
print(df)

      month  Acquired_cus_each_month
0   2023-08                       85
1   2023-09                      255
2   2023-10                      275
3   2023-11                      246
4   2023-12                      244
5   2024-01                      226
6   2024-02                      261
7   2024-03                      249
8   2024-04                      238
9   2024-05                      280
10  2024-06                      250
11  2024-07                      251
12  2024-08                      292
13  2024-09                      221
14  2024-10                      240
15  2024-11                      231
16  2024-12                      257
17  2025-01                      243
18  2025-02                      231
19  2025-03                      231
20  2025-04                      245
21  2025-05                      265
22  2025-06                      249
23  2025-07                      263
24  2025-08                      172

In [74]:
# Q17: What are the sales by food category?  
query="""
SELECT category,SUM(price*quantity) as total_sales
FROM orders 
GROUP BY category
ORDER BY total_sales DESC
"""
df=pd.read_sql(query,db)
print(df)

      category  total_sales
0      Italian   3006032.50
1  Continental   2928524.26
2      Chinese   2889236.97
3    Fast Food   2870929.69
4      Dessert   2649188.66

In [44]:
# Q18: What are the most popular payment methods? 
query="""
SELECT payment_method, COUNT(*) as total
FROM orders 
GROUP BY payment_method
ORDER BY total DESC
"""
df=pd.read_sql(query,db)
print(df)

  payment_method  total
0           Cash   2039
1           Card   2002
2         Wallet   1959

In [48]:
# Q19: What is the customer churn rate?
query="""
SELECT (SUM(churned='Inactive') / COUNT(*)) * 100 AS churn_rate
FROM orders
"""
df=pd.read_sql(query,db)
print(df)

   churn_rate
0     49.7333

In [77]:
# Q20: Who are the high-value customers (spent > 7,000)?
query="""
SELECT customer_id, SUM(price * quantity) AS total_spent
FROM orders 
GROUP BY customer_id 
HAVING total_spent > 7000
ORDER BY total_spent DESC
"""
df=pd.read_sql(query,db)
print(df)

   customer_id  total_spent
0        C3134      7496.85
1        C2515      7495.05
2        C6021      7494.65
3        C2857      7493.60
4        C3320      7491.80
..         ...          ...
85       C5888      7030.20
86       C2369      7017.90
87       C3099      7015.75
88       C5711      7011.05
89       C6074      7010.40

[90 rows x 2 columns]

In [80]:
# 🔁 Retention & Loyalty
# Q21: What is the average loyalty points by city? 
query="""
SELECT city, AVG(loyalty_points) as avg_loyalty_point
FROM orders
GROUP BY city
"""
df=pd.read_sql(query,db)
print(df)

        city  avg_loyalty_point
0   Peshawar           245.5565
1     Multan           252.1425
2     Lahore           249.3377
3  Islamabad           250.0699
4    Karachi           253.8288

In [81]:
# Q22: Is there a correlation between churn and ratings?  
query="""
SELECT churned, AVG(rating) AS avg_rating 
FROM orders 
GROUP BY churned;
"""
df=pd.read_sql(query,db)
print(df)

    churned  avg_rating
0  Inactive      3.0211
1    Active      2.9728

In [87]:
# Q23: What is the repeat purchase rate? 
query="""
SELECT (COUNT(DISTINCT customer_id) - SUM(DISTINCT order_frequency=1 ))
       / COUNT(DISTINCT customer_id) * 100 AS repeat_purchase_rate
FROM orders;
"""
df=pd.read_sql(query,db)
print(df)

   repeat_purchase_rate
0               99.9833

In [88]:
# Q24: Who is the longest active customer?  
query="""
SELECT customer_id, signup_date 
FROM orders 
WHERE churned='Active' 
ORDER BY signup_date ASC 
LIMIT 1
"""
df=pd.read_sql(query,db)
print(df)

  customer_id signup_date
0       C6037  2023-08-22

In [91]:
# Q25: What is the average revenue per active vs inactive customer? 
query="""
SELECT churned ,AVG(price*quantity) as Average_revenue
FROM orders
GROUP BY churned
"""
df=pd.read_sql(query,db)
print(df)

    churned  Average_revenue
0  Inactive      2370.199400
1    Active      2410.887623

In [92]:
# Q26: Build RFM base table for customer segmentation
query="""
SELECT customer_id,
       MAX(order_date) AS last_purchase,
       COUNT(order_id) AS frequency,
       SUM(price * quantity) AS monetary
FROM orders 
GROUP BY customer_id;
"""
df=pd.read_sql(query,db)
print(df)

     customer_id last_purchase  frequency  monetary
0          C6000    2024-08-14          1   3041.40
1          C6001    2024-11-07          1   2541.87
2          C6002    2024-03-24          1   5247.04
3          C6003    2025-04-06          1   4185.88
4          C6004    2024-03-19          1   2106.45
...          ...           ...        ...       ...
5995       C5995    2025-02-11          1   1619.12
5996       C5996    2025-08-04          1   4535.76
5997       C5997    2024-12-18          1   2770.56
5998       C5998    2025-05-21          1   1496.02
5999       C5999    2025-01-26          1   3876.00

[6000 rows x 4 columns]

In [93]:
# Q27: Which cities have the highest customer growth rate?  
query="""
SELECT city, COUNT(DISTINCT customer_id) / COUNT(DISTINCT DATE_FORMAT(signup_date,'%Y-%m')) AS growth_rate
FROM orders 
GROUP BY city 
ORDER BY growth_rate DESC;
"""
df=pd.read_sql(query,db)
print(df)

        city  growth_rate
0     Multan        50.24
1     Lahore        48.68
2   Peshawar        47.80
3  Islamabad        47.48
4    Karachi        45.80

In [95]:
# Q28: Which restaurant has the best average rating? 
query="""
SELECT restaurant_name,AVG(rating) as Average_rating
FROM orders
GROUP BY restaurant_name
ORDER BY Average_rating DESC LIMIT 1
"""
df=pd.read_sql(query,db)
print(df)

  restaurant_name  Average_rating
0          Subway          3.0873

In [5]:
# Q29: Which customers are at risk of churn (low loyalty + low ratings)?  
query="""
SELECT customer_id, loyalty_points, AVG(rating) AS avg_rating
FROM orders 
GROUP BY customer_id, loyalty_points
HAVING loyalty_points < 50 AND avg_rating < 3;
"""
df=pd.read_sql(query,db)
print(df)

    customer_id  loyalty_points  avg_rating
0         C6013              27         1.0
1         C6038              11         1.0
2         C6045              21         2.0
3         C6057              20         2.0
4         C6097               4         2.0
..          ...             ...         ...
236       C5920               9         2.0
237       C5948              27         1.0
238       C5964              26         1.0
239       C5985              12         1.0
240       C5987              45         1.0

[241 rows x 3 columns]